In [1]:
import numpy as np
import pandas as pd

In [2]:
df1 = pd.DataFrame()
df2 = pd.DataFrame()

In [3]:
df1['viewers'] = ["Sushmita", "Aditya", "Bala", "Anurag"]
df2['users'] = ["Aditya", "Anurag", "Bala", "Sushmita", "Apoorva"]

In [4]:
np.random.seed(202)

In [5]:
df1 = df1.assign(
    views=np.random.normal(100, 100, 4)
)
df2 = df2.assign(
    cost=[20, np.nan, 15, 2, 7] 
)

In [7]:
df1.head()

    viewers       views
0  Sushmita   26.412626
1    Aditya   13.984684
2      Bala    7.671759
3    Anurag  123.845313

In [8]:
df2.head()

      users  cost
0    Aditya  20.0
1    Anurag   NaN
2      Bala  15.0
3  Sushmita   2.0
4   Apoorva   7.0

Performing a left join of df1 with df2. We specify the joining key as viewers and on the right as users
This will include all elements in df1 and the users that will match with viewers.

In [9]:
df = df1.merge(df2, left_on="viewers", right_on="users", how="left")

In [10]:
df.head()

    viewers       views     users  cost
0  Sushmita   26.412626  Sushmita   2.0
1    Aditya   13.984684    Aditya  20.0
2      Bala    7.671759      Bala  15.0
3    Anurag  123.845313    Anurag   NaN

To handle the NaN value in the last column we replace it with the mean value of that column

In [12]:
df.fillna(df.mean())

    viewers       views     users       cost
0  Sushmita   26.412626  Sushmita   2.000000
1    Aditya   13.984684    Aditya  20.000000
2      Bala    7.671759      Bala  15.000000
3    Anurag  123.845313    Anurag  12.333333